<?php

return [
    'user' => [
        'status' => [
            0 => '正常',
            1 => '停用',
            2 => '冻结',
            3 => '确定冻结',
            4 => '演员',
            9 => '确定正常',
        ],
        'status_help' => [
            0 => '正常操作系统中任何开放功能',
            1 => '该账户无法登录APP',
            2 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            3 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            4 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            9 => '这些类型的用户是确定了的正常用户,不会被扫描为薅羊毛用户',
        ]
    ],

    'mark_user' => [
        'mark_type' => [
            0 => '未标记',
            1 => '想去/计划',
            2 => '已完成/已去/已看',
        ],
    ],

    'wallet_asset' => [
        'module_code' => [
            'ADMIN' => '系统',
            'FARM_TASK' => '农场任务',
        ],
    ],
    'mark_item' => [
        'status' => [
            0 => '取消',
            1 => '计划',
            2 => '完成',
        ],
    ],

    // --------农场部分------------------------
    'task' => [
        'quality_type' => [
            0 => '普通',
            1 => '高级',
            2 => '稀有',
        ],
    ],
    'user_task' => [
        'status' => [
            0 => '待完成',
            1 => '已完成',
            2 => '已放弃',
        ]
    ],
    'farm_shop_type' => [
        'seed' => '种子',
        'product' => '产品',
        'tool' => '工具',
    ],
    'farm_warehouse' => [
        'type' => [
            'seed' => '种子',
            'fruit' => '果实',
            'product' => '产品',
            'tool' => '工具',
        ],
    ]
];
