<?php

return [
    'wallet_bridge_status' => [
        'CREATED' => '待Link',
        'AUDIT' => 'Link中',
        'AUDITED' => 'Link中',
        'SENT' => 'Link成功',
        'SUCCEEDED' => 'Link成功',
        'FAILED' => '待Link',
        'CANCELED' => '待Link'
    ],
    'user' => [
        'status' => [
            0 => '正常',
            1 => '停用',
            2 => '冻结',
            3 => '确定冻结',
            4 => '演员',
            9 => '确定正常',
        ],
        'status_help' => [
            0 => '正常操作系统中任何开放功能',
            1 => '该账户无法登录APP',
            2 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            3 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            4 => '该账户可以登录，但是该帐号无法操作(提现、兑换、等)',
            9 => '这些类型的用户是确定了的正常用户,不会被扫描为薅羊毛用户',
        ]
    ],

    'mark_user' => [
        'mark_type' => [
            0 => '未标记',
            1 => '想去/计划',
            2 => '已完成/已去/已看',
        ],
    ],

    'wallet_asset' => [
        'module_code' => [
            'BUY_NODE' => '兑换节点',
            'BUY_NFT' => '兑换NFT',
            'NODE_DIRECT_REWARD' => 'node直接奖励',
            'NODE_INDIRECT_REWARD' => 'node间推奖励',
            'NFT_DIRECT_REWARD' => 'nft直接奖励',
            'NFT_INDIRECT_REWARD' => 'nft间推奖励',
            'DEPOSIT' => '充值',
            'WITHDRAW' => '提现',
            'WITHDRAW_CANCELED' => '提现退回',
            'ADMIN' => '系统充值',
        ],
    ],
    'wallet_deposit' => [
        'status' => [
            'CREATED' => '请求交易',
            'LACKED' => '额度不足',
            'SUCCESS' => '交易成功',
            'FAILED' => '交易失败',
        ]
    ],
    'wallet_withdraw' => [
        'status' => [
            'CREATED' => '待上链',
            'AUDITED' => '上链中',
            'SENT' => '区块确认中',
            'SUCCEEDED' => '上链成功',
            'FAILED' => '上链失败',
            'CANCELED' => '上链失败',
        ]
    ],
    'mark_item' => [
        'status' => [
            0 => '取消',
            1 => '计划',
            2 => '完成',
        ],
    ],


    // 农场部分
    'farm_user' => [
        'level_title' => [
            0 => '凡人',
            1 => '练气一层',
            2 => '练气二层',
            3 => '练气三层',
            4 => '练气四层',
            5 => '练气五层',
            6 => '练气六层',
            7 => '练气七层',
            8 => '练气八层',
            9 => '练气九层',
            10 => '筑基初期',
            11 => '筑基初期',
            12 => '筑基初期',
            13 => '筑基中期',
            14 => '筑基中期',
            15 => '筑基中期',
            16 => '筑基后期',
            17 => '筑基后期',
            18 => '筑基后期',
            19 => '筑基巅峰',
            20 => '结丹初期',
            21 => '结丹初期',
            22 => '结丹初期',
            23 => '结丹中期',
            24 => '结丹中期',
            25 => '结丹中期',
            26 => '结丹后期',
            27 => '结丹后期',
            28 => '结丹后期',
            29 => '结丹巅峰',
            30 => '元婴初期',
            31 => '元婴初期',
            32 => '元婴初期',
            33 => '元婴中期',
            34 => '元婴中期',
            35 => '元婴中期',
            36 => '元婴后期',
            37 => '元婴后期',
            38 => '元婴后期',
            39 => '元婴巅峰',
            40 => '化神初期',
            41 => '化神初期',
            42 => '化神初期',
            43 => '化神中期',
            44 => '化神中期',
            45 => '化神中期',
            46 => '化神后期',
            47 => '化神后期',
            48 => '元婴后期',
            49 => '元婴巅峰',
            50 => '炼虚'
        ],
    ]
];
